CSI API ETABS v1

# cFile Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cFile

    Public Interface cFile

    Dim instance As cFile

    public interface class cFile

    type cFile =  interface end

The cFile type exposes the following members.

Methods

| Name| Description
---|---|---
|
GetFilePath|
|
NewBlank|  Creates a new, blank
model.
|
NewGridOnly|  Creates a new grid-
only model from template.
|
NewSteelDeck|  Creates a new steel
deck model from template.
|
OpenFile|  Opens an existing file.
|
Save|  Saves the present model.
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com